package com.sist.main;
/*
 *     자바
 *     ---
 *     프로그램의 핵심 : 데이터 관리
 *      변수,배열,클래스,파일,오라클,XML,JSON
 *      => 데이터 베이스
 *      => 머신러닝/딥러닝
 *         => 데이터수집,데이터전처리,분석
 *     
 *     프로젝트
 *     ------
 *     => 벤치마킹(아이템)
 *        => 예약(예매),추천,결제
 *        -------------------
 *          | =>출력할 데이터가 가장 먼저 필요함~~(구현을 해야하니까)
 *     => 요구사항 분석
 *        ---------- 필요한 데이터(크롤링)
 *     => 오라클에 저장하기(데이터베이스설계)
 *     => 화면UI
 *     => 구현
 *     => 테스트
 *     => 배포(발표) ==> 호스팅(AWS)
 *     
 *          
 *          react는 데이터 관리가 근간임
 *          
 *        
 */
public class MainClass_2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
